; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 13782)
	(= (fuel plane1) 3890)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 16)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city0)
	(= (capacity plane2) 2691)
	(= (fuel plane2) 247)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city5)
	(= (capacity plane3) 11233)
	(= (fuel plane3) 1914)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 17)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city1)
	(= (capacity plane4) 2768)
	(= (fuel plane4) 302)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at plane5 city2)
	(= (capacity plane5) 2485)
	(= (fuel plane5) 667)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 2)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 6)
	(at person1 city2)
	(at person2 city4)
	(at person3 city7)
	(at person4 city8)
	(at person5 city6)
	(at person6 city8)
	(at person7 city1)
	(at person8 city3)
	(at person9 city0)
	(at person10 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 977)
	(= (distance city0 city2) 743)
	(= (distance city0 city3) 913)
	(= (distance city0 city4) 715)
	(= (distance city0 city5) 955)
	(= (distance city0 city6) 897)
	(= (distance city0 city7) 595)
	(= (distance city0 city8) 809)
	(= (distance city1 city0) 977)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 540)
	(= (distance city1 city3) 630)
	(= (distance city1 city4) 921)
	(= (distance city1 city5) 933)
	(= (distance city1 city6) 943)
	(= (distance city1 city7) 865)
	(= (distance city1 city8) 597)
	(= (distance city2 city0) 743)
	(= (distance city2 city1) 540)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 874)
	(= (distance city2 city4) 834)
	(= (distance city2 city5) 886)
	(= (distance city2 city6) 867)
	(= (distance city2 city7) 922)
	(= (distance city2 city8) 555)
	(= (distance city3 city0) 913)
	(= (distance city3 city1) 630)
	(= (distance city3 city2) 874)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 721)
	(= (distance city3 city5) 803)
	(= (distance city3 city6) 544)
	(= (distance city3 city7) 785)
	(= (distance city3 city8) 518)
	(= (distance city4 city0) 715)
	(= (distance city4 city1) 921)
	(= (distance city4 city2) 834)
	(= (distance city4 city3) 721)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 866)
	(= (distance city4 city6) 712)
	(= (distance city4 city7) 970)
	(= (distance city4 city8) 897)
	(= (distance city5 city0) 955)
	(= (distance city5 city1) 933)
	(= (distance city5 city2) 886)
	(= (distance city5 city3) 803)
	(= (distance city5 city4) 866)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 799)
	(= (distance city5 city7) 947)
	(= (distance city5 city8) 641)
	(= (distance city6 city0) 897)
	(= (distance city6 city1) 943)
	(= (distance city6 city2) 867)
	(= (distance city6 city3) 544)
	(= (distance city6 city4) 712)
	(= (distance city6 city5) 799)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 712)
	(= (distance city6 city8) 662)
	(= (distance city7 city0) 595)
	(= (distance city7 city1) 865)
	(= (distance city7 city2) 922)
	(= (distance city7 city3) 785)
	(= (distance city7 city4) 970)
	(= (distance city7 city5) 947)
	(= (distance city7 city6) 712)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 596)
	(= (distance city8 city0) 809)
	(= (distance city8 city1) 597)
	(= (distance city8 city2) 555)
	(= (distance city8 city3) 518)
	(= (distance city8 city4) 897)
	(= (distance city8 city5) 641)
	(= (distance city8 city6) 662)
	(= (distance city8 city7) 596)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane4 city1)
	(at plane5 city1)
	(at person1 city6)
	(at person2 city3)
	(at person5 city5)
	(at person6 city2)
	(at person7 city0)
	(at person8 city1)
	(at person9 city4)
	(at person10 city8)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city1)
   changed: (fuel plane1) from 3890 to 13782
   goals met: 1 of 10
2. (fly plane5 city2 city1)
   deleted: (at plane5 city2)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 0 to 540, (fuel plane5) from 667 to 127
   goals met: 2 of 10
3. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 540 to 5145, (fuel plane1) from 13782 to 9177
   goals met: 2 of 10
4. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
5. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 5145 to 8750, (fuel plane1) from 9177 to 5572
   goals met: 2 of 10
6. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 10
7. (board person8 plane1 city3)
   deleted: (at person8 city3)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
8. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 8750 to 13120, (fuel plane1) from 5572 to 1202
   goals met: 3 of 10
9. (refuel plane1 city2)
   changed: (fuel plane1) from 1202 to 13782
   goals met: 3 of 10
10. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 10
11. (board person10 plane1 city2)
   deleted: (at person10 city2)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 10
12. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 13120 to 17455, (fuel plane1) from 13782 to 9447
   goals met: 3 of 10
13. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 10
14. (fly plane1 city6 city8)
   deleted: (at plane1 city6)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 17455 to 20765, (fuel plane1) from 9447 to 6137
   goals met: 4 of 10
15. (debark person10 plane1 city8)
   deleted: (in person10 plane1)
   added: (at person10 city8)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 10
16. (board person6 plane1 city8)
   deleted: (at person6 city8)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 10
17. (fly plane1 city8 city1)
   deleted: (at plane1 city8)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 20765 to 23750, (fuel plane1) from 6137 to 3152
   goals met: 5 of 10
18. (refuel plane5 city1)
   changed: (fuel plane5) from 127 to 2485
   goals met: 5 of 10
19. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 10
20. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 23750 to 26450, (fuel plane1) from 3152 to 452
   goals met: 6 of 10
21. (debark person6 plane1 city2)
   deleted: (in person6 plane1)
   added: (at person6 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
22. (board person7 plane5 city1)
   deleted: (at person7 city1)
   added: (in person7 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 7 of 10
23. (fly plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 26450 to 27427, (fuel plane5) from 2485 to 1508
   goals met: 6 of 10
24. (debark person7 plane5 city0)
   deleted: (in person7 plane5)
   added: (at person7 city0)
   changed: (onboard plane5) from 1 to 0
   goals met: 7 of 10
25. (board person9 plane5 city0)
   deleted: (at person9 city0)
   added: (in person9 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 7 of 10
26. (fly plane5 city0 city4)
   deleted: (at plane5 city0)
   added: (at plane5 city4)
   changed: (total-fuel-used) from 27427 to 28142, (fuel plane5) from 1508 to 793
   goals met: 7 of 10
27. (refuel plane5 city4)
   changed: (fuel plane5) from 793 to 2485
   goals met: 7 of 10
28. (debark person9 plane5 city4)
   deleted: (in person9 plane5)
   added: (at person9 city4)
   changed: (onboard plane5) from 1 to 0
   goals met: 8 of 10
29. (fly plane5 city4 city6)
   deleted: (at plane5 city4)
   added: (at plane5 city6)
   changed: (total-fuel-used) from 28142 to 28854, (fuel plane5) from 2485 to 1773
   goals met: 8 of 10
30. (board person5 plane5 city6)
   deleted: (at person5 city6)
   added: (in person5 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 8 of 10
31. (fly plane5 city6 city5)
   deleted: (at plane5 city6)
   added: (at plane5 city5)
   changed: (total-fuel-used) from 28854 to 29653, (fuel plane5) from 1773 to 974
   goals met: 8 of 10
32. (debark person5 plane5 city5)
   deleted: (in person5 plane5)
   added: (at person5 city5)
   changed: (onboard plane5) from 1 to 0
   goals met: 9 of 10
33. (fly plane5 city5 city1)
   deleted: (at plane5 city5)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 29653 to 30586, (fuel plane5) from 974 to 41
   goals met: 10 of 10
